snlkuharlocal/src/InformationRegisters/Подчиненные/Подчиненные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Подчиненные</name>
  <resources>
    <name>ДокументПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подчиненный</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/CommonModules/Подчиненность/Module.bsl
Функция СсылкаДокумент(ДокСсылка) 
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ДокСсылка));
	Если Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции	
Функция ПодчиненностьОбработана(ДокСсылка) Экспорт  
		Возврат Ложь;
	Запрос = Новый ЗАпрос("ВЫБРАТЬ первые 1
	                      |	Подчиненные.Основание КАК Основание
	                      |ИЗ
	                      |	РегистрСведений.Подчиненные КАК Подчиненные
	                      |ГДЕ
	                      |	Подчиненные.Основание = &Документ
	                      |	");   
	Запрос.УстановитьПараметр("Документ",ДокСсылка);
	Таб = Запрос.Выполнить().Выгрузить();
	Если Таб.Количество()=0 Тогда    
		ЗаписатьПодчиненность(ДокСсылка);
		Возврат Истина;	
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции	
Функция ПолучитьПодчиненных(ДокСсылка) Экспорт   
	Запрос = Новый ЗАпрос("ВЫБРАТЬ
	                      |	Подчиненные.Подчиненный КАК Ссылка,
	                      |	Подчиненные.ВидДокумента КАК ВидДокумента,
	                      |	Подчиненные.ДокументПредставление КАК ДокументПредставление,
	                      |	Подчиненные.Проведен КАК Проведен,
	                      |	Подчиненные.ПометкаУдаления КАК ПометкаУдаления
	                      |ИЗ
	                      |	РегистрСведений.Подчиненные КАК Подчиненные
	                      |ГДЕ
	                      |	Подчиненные.Основание = &ДокументОснование
	                      |	И НЕ Подчиненные.ВидДокумента = """"");
	Запрос.УстановитьПараметр("ДокументОснование", ДокСсылка);        
	Возврат ЗАпрос.Выполнить().Выгрузить();
КонецФункции

Процедура ЗаписатьПодчиненность(ДокСсылка) Экспорт 
	
	Если НЕ СсылкаДокумент(ДокСсылка) Тогда
		Возврат;
	КонецЕсли;	   
	
	ТипДокумента = ТипЗнч(ДокСсылка);
	
	СтруктураРеквизитов = Новый ТаблицаЗначений;
	СтруктураРеквизитов.Колонки.Добавить("ПутьКДанным");
	СтруктураРеквизитов.Колонки.Добавить("ИмяРеквизита");
	
	Для каждого Док ИЗ Метаданные.Документы Цикл
		Если НЕ ПравоДоступа("Чтение", Док) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Реквизит Из Док.Реквизиты Цикл
			Если Реквизит.Тип.СодержитТип(ТипДокумента) Тогда			
				НовСтр = СтруктураРеквизитов.Добавить();
				НовСтр.ПутьКДанным = Док.Имя;
				НовСтр.ИмяРеквизита = Реквизит.Имя;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТЧ ИЗ Док.ТабличныеЧасти Цикл
			Для Каждого Реквизит Из ТЧ.Реквизиты Цикл
				Если Реквизит.Тип.СодержитТип(ТипДокумента) Тогда
					НовСтр = СтруктураРеквизитов.Добавить();
					НовСтр.ПутьКДанным = Док.Имя+"."+ТЧ.Имя;
					НовСтр.ИмяРеквизита = Реквизит.Имя;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;		
		
	КонецЦикла;	
	ТекстЗапроса = "";
 	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		Если НЕ ТекстЗапроса = "" Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|ОБЪЕДИНИТЬ 
			|";
		КонецЕсли;	
		Если Найти(КлючИЗначение.ПутьКДанным, ".") = 0 Тогда
		
			ТекстЗапроса = ТекстЗапроса + "
			|Выбрать различные &ДокументОснование Основание,Ссылка Подчиненный, Представление(Ссылка) ДокументПредставление, Проведен, ПометкаУдаления,"""+ КлючИЗначение.ПутьКДанным +""" КАК ВидДокумента 
			|ИЗ Документ."+КлючИЗначение.ПутьКДанным+"
			|ГДЕ "+КлючИЗначение.ИмяРеквизита+"=&ДокументОснование 
			|";
			
		Иначе
			ПозицияТочки = Найти(КлючИЗначение.ПутьКДанным, ".");
			ТекстЗапроса = ТекстЗапроса + "
			|Выбрать различные &ДокументОснование Основание,Ссылка Подчиненный, Представление(Ссылка) ДокументПредставление, Ссылка.Проведен, Ссылка.ПометкаУдаления,"""+ КлючИЗначение.ПутьКДанным +""" КАК ВидДокумента 
			|ИЗ Документ."+КлючИЗначение.ПутьКДанным+"
			|ГДЕ "+КлючИЗначение.ИмяРеквизита+"=&ДокументОснование 
			|";
			
		КонецЕсли;
	КонецЦикла;
	
	Если ТекстЗапроса="" Тогда
		Возврат;
	КонецЕсли;		
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокументОснование", ДокСсылка);
	ТабПодчиненных = Запрос.Выполнить().Выгрузить();   
	НЗ = РегистрыСведений.Подчиненные.СоздатьНаборЗаписей();
	НЗ.Отбор.Основание.Установить(ДокСсылка);
	НЗ.Загрузить(ТабПодчиненных); 
	НЗ.Записать(Истина);    
	
	МЗ = РегистрыСведений.Подчиненные.СоздатьМенеджерЗаписи();
	МЗ.Основание = ДокСсылка;  
	МЗ.Подчиненный = Неопределено;
	МЗ.Записать(Истина);
КонецПроцедуры	
Процедура ОчиститьПодчиненность(ДокСсылка) Экспорт  
	
	Если НЕ СсылкаДокумент(ДокСсылка) Тогда
		Возврат;
	КонецЕсли;	 
	
	НЗ = РегистрыСведений.Подчиненные.СоздатьНаборЗаписей();
	НЗ.Отбор.Основание.Установить(ДокСсылка);
	НЗ.Записать(Истина);    
КонецПроцедуры
